var app = function(){
	var selfApp = this;
	this.allWords = [];
	var timeItl = undefined;
	this.nextOne = function(id){
		this.updateWord("#word_" + id);			
		this.updateScore("#score_"+id, "add");
	};

	this.stepOver = function(id){
		this.updateWord("#word_"+ id);
	};

	this.restart = function(){
		try{
			clearInterval(timeItl);
		}catch(e){
		}
		var ids = ["left", "right"];	
		for(var i = 0 ;i < ids.length;i ++){
			this.updateScore("#score_" + ids[i], "init");
			this.updateWord("#word_" + ids[i]);
		}
		this.startTime();
		this.toggleBtnActive(true);
	};

	this.startTime = function(){
		this.updateTime("init");
		timeItl = setInterval(function(){
			selfApp.updateTime("dec");	
		}, 1000);	
	};

	this.updateTime = function(act){
		if(act === "init")
			$("#time").html((Config.totalTime).toString());
		else if(act === "dec"){
			$("#time").html((parseInt($("#time").html()) - 1).toString());
			if (parseInt($("#time").html()) === 0){
					clearInterval(timeItl);
					this.toggleBtnActive(false);
			}
		}	
	};

	this.updateScore = function(id, act){
		if (act === "init"){
			$(id).html("0");	
		}else if(act === "add"){
			$(id).html((parseInt($(id).html()) + 1).toString());	
		}
	};

	this.updateWord = function(id){
		this.dtd = $.Deferred();
		this.getNextRandomWord();
		$.when(this.dtd)
			.done(function(){
				$(id).html(selfApp.currW);
			})
			.fail(function(){
				$(id).html("No More Word");
			});
	};

	this.getNextRandomWord = function(){
		var length = this.allWords.length;
		var isFind = false;
		var isFull = false;
		var ret = undefined;
		
		var getWord = function(){
			var w = this.allWords[Math.floor(Math.random() * length)];
			var dtd = $.Deferred();
			Lawnchair(function(){ 	
					this.get("alreadynum", function(la){
						if(la.value === length){
						   	isFull = true;	
							selfApp.toggleBtnActive(false);
						}
						this.exists(w, function(isExists){
							if (!isExists){
								this.save({
									key:w,
									value:w
								});// ´æ´¢ÓÚcookieÖÐ
								this.save({
									key:"alreadynum",
									value:la.value + 1
								});
								isFind = true;
							}
							dtd.resolve();
						});	

					});
				});
			
			$.when(dtd)
			.done(function(){
				if(isFind){
					selfApp.currW = w;	
					selfApp.dtd.resolve();
				}
				if(isFull){
					selfApp.currW = undefined;
					selfApp.dtd.reject();
				}
				if(!isFind && !isFull){
					getWord();
				}
			})
			.fail(function(){
				;	
			});
		};	
		getWord();
	};
	
	this.toggleBtnActive = function(isActive){
		var btns = ["nextone_btn_left", "nextone_btn_right", "stepover_btn_left", "stepover_btn_right"];
			
		for (var i = 0; i < btns.length; i ++){
			$("#" + btns[i]).attr('disabled',!isActive); 
		}	
	};
	this.init = function(){
		$("#nextone_btn_left").click(function(){
			selfApp.nextOne("left");
		});

		$("#nextone_btn_right").click(function(){
			selfApp.nextOne("right");
		});

		$("#stepover_btn_left").click(function(){
			selfApp.stepOver("left");
		});

		$("#stepover_btn_right").click(function(){
			selfApp.stepOver("right");
		});

		$("#start_btn").click(function(){
			selfApp.restart();
		});
		
		$("#time").html(Config.totalTime.toString());
		this.toggleBtnActive(false);
		if(!Config.noRepeated) {
			//Çå³ýcookieÖÐµÄÊý¾Ý	
			Lawnchair(function(){
						this.nuke();
					}); 
		}

		Lawnchair(function(){
			this.exists("alreadynum", function(isExisted){
				if(!isExisted){	
					this.save({
						key:"alreadynum",
						value:0
					});
				}
			});
		});

		this.allWords = [
"Í¿½ÞÃ«¸à",
"¸¶¿î",
"´ó×ì°Í",
"¿ªµÆ",
"ÐÄÐÄÏàÓ¡",
"ÔÂ±ý",
"ÎÏÅ£",
"Ã»ÐÄÃ»·Î",
"´ó·ÊÖí",
"Ä¢¹½",
"µ°³´·¹",
"×ãÇò",
"±ÕÄ¿ÑøÉñ",
"Ò»ÇÏ²»Í¨",
"µç»°",
"Á½ÃæÈýµ¶",
"×¥¶úÄÓÈù",
"Ä¾¶ú",
"¿ªµ¶",
"ÒÆ»¨½ÓÄ¾",
"ÌÆÉ®",
"÷ÈÁ¦Ê®×ã",
"¿ÕÆøºôÎüÆ÷",
"Ë®ä°´«",
"Ì©É½",
"ÌÆÉ½",
"ËãÅÌ",
"Ó¥¹³±Ç",
"ÏãË®",
"Ï²ÑòÑò",
"Çë¼Ù",
"³´²Ë",
"ÈË",
"ÎÃ×Ó",
"°²È«Ã±",
"Ã¼À´ÑÛÈ¥",
"Å£ÀÉÖ¯Å®",
"³ÔÎ÷¹Ï",
"¿ª»á",
"¿ê×Ó",
"×ÔÑÔ×ÔÓï",
"ÈÕÀú",
"ÎåºþËÄº£",
"Î¢²¨Â¯",
"ÕÔ×ÓÁú",
"ó¬ó°",
"ÏàÉù",
"Ììº®µØ¶³",
"Ï´ÒÂ·þ",
"ó«òë",
"¿ì²Í",
"ÕÕ¾µ×Ó",
"ÈýÐÄ¶þÒâ",
"Ãæ±ÚË¼¹ý",
"Å£Ä§Íõ",
"ÎÅ¼¦ÆðÎè",
"¿ÚÊÇÐÄ·Ç",
"ÅÄÂíÆ¨",
"µçÌÝ",
"¡¶Î÷ÓÎ¼Ç¡·",
"¼Ã¹«",
"ÁõÈôÓ¢",
"Ä¿ÖÐÎÞÈË",
"ÌìµÈ",
"ÃÅµ±»§¶Ô",
"»ð¹ø",
"Í¬´²¹²Õí",
"²»¿É¿ª½»",
"Äµµ¤»¨",
"ÇÄÇÄ»°",
"É½¸è",
"±ùÏä",
"SÐÍ",
"×Ï¾£»¨",
"ÎÞËù²»Îª",
"±©ÌøÈçÀ×",
"Í¬¸Ê¹²¿à",
"É½ÇåË®Ðã",
"Á³Åè",
"³Ùµ½",
"ÀÇ±·Îª¼é",
"¶ªÈýÂäËÄ",
"ÌÔ±¦Íø",
"ËÄ´óÃÀÅ®",
"Í·ÖØ½ÅÇá",
"¾ÅËÀÒ»Éú",
"Ò»´ç¹âÒõÒ»´ç½ð",
"´©É½¼×",
"ÉÏ´ÚÏÂÌø",
"¿§·È",
"ÁõÏè",
"´º½Ú",
"ÌøË®",
"¶«µ¹Î÷Íá",
"Á÷Ã¥",
"½ÆÍÃÈý¿ß",
"Ð¡°×ÍÃ",
"Ñ©Á«",
"×óÓÒ¿ª¹­",
"´³ºìµÆ",
"¿¼ÊÔ",
"¿ªÃÅ",
"ÍÁÉúÍÁ³¤",
"°ÙÉ«",
"»°Í²",
"¿ªÐÄ¹û",
"°×Õ¶¹·",
"ºûµû",
"Ã¤ÈËÃþÏó",
"ÉØÉ½",
"ºï×Ó",
"³Ô±¥ÁË³Å×ÅÃ»ÊÂ¸É",
"Ê¨×Ó",
"»ÆºÓ",
"Ê¥µ®½Ú",
"ÒÂ¹ÚÇéÊÞ",
"¼ñµ½Ç®",
"ÖÜ»ª½¡",
"ÑòÈë»¢¿Ú",
"Ò£¿ØÆ÷",
"Ó©»ð³æ",
"²¼´ïÀ­¹¬",
"Ï²ÑóÑó",
"ÀëÐÄ±Ã",
"ÐÉÐÉ",
"¿à¹Ï",
"Êé°ü",
"¾ªÌì¶¯µØ",
"ÇòÅÄ",
"²ÔÓ¬",
"Ç§É½ÍòË®",
"ÃÛ·ä",
"Ã·»¨",
"ÊÖµçÍ²",
"ó¦Ð·",
"¿Û¹¤×Ê",
"Å£ÄÌ",
"åÞ¹·",
"Ò§ÑÀÇÐ³Ý",
"µçÄÔ",
"´²µæ",
"´ò²Ý¾ªÉß",
"Õ¼×ù",
"Ò¦Ã÷",
"°ÙÎÅ²»ÈçÒ»¼û",
"ÊÖÌ×",
"´óÏó",
"Ò»¼ûÖÓÇé",
"Èý´ÓËÄµÂ",
"³ÉÁú",
"³ÔÁ¦²»ÌÖºÃ",
"²èÒ¶",
"µç·¹¹ø",
"Ð«×Ó",
"¿ªÐÄÍø",
"¡¶ºìÂ¥ÃÎ¡· ÈÚË®",
"Ì¸Áµ°®",
"ÀîÁ¬½Ü",
"ÓÎÓ¾",
"´òÌ«¼«",
"´ò×ø",
"¼¦ÍÈ",
"ÐüÑÂÀÕÂí",
"´×Ì³×Ó",
"Ïã½¶",
"¾µ×Ó",
"°¢µÏ´ï",
"¿õ¹¤",
"±ÈÒíË«·É",
"Á½Àß²åµ¶",
"Âóµ±ÀÍ",
"ºº±¤°ü",
"½»°à",
"¼·¹«½»",
"°®ÄãÒ»ÍòÄê",
"À¯Öò",
"½íàþ²»ÈÃÐëÃ¼",
"½ðÇ®±ª",
"Ò»ÊÖÕÚÌì",
"³ô³æ",
"è¤Ù¤",
"ÑÐ¾¿Éú",
"Ò»È³Ò»¹Õ",
"Ã¼¿ªÑÛÐ¦",
"µ·µ°",
"ÌøÆå",
"×ó¹ËÓÒÅÎ",
"±ý¸É",
"ÎåÑÕÁùÉ«",
"Ð±Ëþ",
"ÖÐ´ó½±",
"ÏîÁ´",
"¸ôÉ½´òÅ£",
"Åõ³¡",
"ÈËÃæÊÞÐÄ",
"·¢Ð½Ë®",
"×ø¾®¹ÛÌì",
"Ä¸¼¦",
"³¬¼¶Å®Éú",
"¹þÃÜ¹Ï",
"¸¹Ðº",
"Ó£ÌÒÐ¡×ì",
"ÃÀ¹ú",
"ÎåÊ®²½Ð¦°Ù²½",
"ÍòÊÂ¾ã±¸",
"Ñà×Ó",
"¡¶ºìÂ¥ÃÎ¡·",
"¸ðÖÞ°Ó",
"´×",
"ÓÐÉùÓÐÉ«",
"ÑÀ¸à",
"ÕÔ±¾É½",
"³¤½­",
"ÍøÇò",
"ÖÜ½ÜÂ×",
"ÍÏµØ°å",
"ÊØÖê´ýÍÃ",
"ÆßÉÏ°ËÏÂ",
"ºÈ²Ê",
"QQ",
"ÀÍ¶¯½Ú",
"ÌøÔé",
"çß½­",
"ÆûË®",
"³¤Óõ¶ÌÌ¾",
"ÓÐÔöÎÞ¼õ",
"¿Úºì",
"»­ÉßÌí×ã",
"¹ÄÕÆ",
"ÊÖ»ú",
"Ò»¶øÔÙÔÙ¶øÈý",
"Ò»Ä¿ÁËÈ»",
"°ÂÌØÂü",
"ÃÀÅ®",
"°×ÈÕ×öÃÎ",
"ÌÒ»¨",
"¸ÏÊ±÷Ö",
"¼¦·É¹·Ìø",
"°ºÊ×Í¦ÐØ",
"½ï½ï¼Æ½Ï",
"Ã«½í",
"ºï×ÓÀÌÔÂ",
"ÀÏÊó",
"½½»¨",
"¹ÒµÆÁý",
"°ô°ôÌÇ",
"ÖÜÈó·¢",
"²»²îÇ®",
"½¡Éí²Ù",
"ÖÐÊî",
"ÂÌ²è",
"Å×ÃÄÑÛ",
"Í´¿ÞÁ÷Ìé",
"Áõ»¶",
"µç·çÉÈ",
"´µ¿ÚÉÚ",
"ÐÄÓÐÁéÏ¬Ò»µãÍ¨",
"ÖÐÇï½Ú",
"µçÊÓ»ú",
"»ÐÈ»´óÎò",
"¬×¥¶úÄÓÈù",
"É¨µØ",
"»îÓ¡Ë¢",
"´µÅ£Æ¤",
"Æï×ÔÐÐ³µ",
"ÍÒÄñ",
"½È×Ó",
"ÁúÑÛ",
"É«ÀÇ",
"°®¿Þ¹í",
"ÂíÁåÊí",
"ËõÍ·ÎÚ¹ê",
"Ë«ÑÛÆ¤",
"°üÇàÌì",
"ÍâÂô",
"´ó¾ªÐ¡¹Ö",
"Ìì¿Ó",
"¶«Ê©Ð§ò­",
"Î¹¼¦",
"Ó×¶ùÔ°",
"ÒôÏì",
"Ï´Íë",
"µßÈýµ¹ËÄ",
"°Ù¶È",
"ÀÇÍÌ»¢ÑÊ",
"Ñ¹Ëõ»ú",
"·­Éí",
"É××Óµç»°",
"ÖÖ²Ë",
"±±¼«ÐÜ",
"Ö¸ÊÖ»­½Å",
"¶¬¹Ï",
"Ó£»¨",
"°Â°ÍÂí",
"¼¡Èâ×¢Éä",
"¹þ¹þ´óÐ¦",
"³éÑÌ",
"Ò»ÎåÒ»Ê®",
"¼ÆÁ¿±Ã",
"ÎåÒô²»È«",
"»ð²ñ",
"°µËÍÇï²¨",
"³Ô²»ÁË¶µ×Å×ß",
"ÎÒ°ÖÊÇÀî¸Õ",
"ÑÚ¶úµÁÁå",
"±±¾©¿¾Ñ¼",
"ºËÌÒ",
"¹ýÂËÆ÷",
"Ê®È«Ê®ÃÀ",
"ÀîÄþ",
"ÊáÍ·",
"ËÎ×æÓ¢",
"ÈÕ¹âµÆ¼ÆËãÆ÷",
"Ë®ÂäÊ¯³ö",
"³´·¹",
"´üÊó",
"ÓðÃ«Çò",
"Ö¸ÄÏÕë",
"¶ÔÅ£Ì¸ÇÙ",
"ÐÂÎÅÁª²¥",
"ÈöÍÈ¾ÍÅÜ",
"Ò»ÐÄÁ½ÓÃ",
"Íã¶¹",
"¶úÄ¿Ò»ÐÂ",
"Î§½íÍÏÀ­»ú",
"ÁõµÂ»ª",
"±¿ÄñÏÈ·É",
"ÌìÌìÏòÉÏ",
"¸ß±ÇÁº",
"¼¦µ°",
"³ÔÀï°ÇÍâ",
"ÕÅ·É",
"°ËÏÉ¹ýº£",
"ÂíÍ°",
"°ÙºÏ»¨",
"¾«ÁóËþ",
"Ã¢¹û",
"Ç°¸©ºóÑö",
"Ò½Ôº",
"¶ËÎç½Ú",
"Ð¡Æ·",
"Î§È¹",
"À±½·",
"¿ÕÆøÇåÐÂ¼Á",
"ÅÝÃæ",
"ÓÍÌõ",
"´¹Í·É¥Æø",
"½á»é",
"×Ô²»Á¿Á¦",
"ÎÂ¶È¼Æ",
"Èý³¤Á½¶Ì",
"Ô¼»á",
"·ò³ª¸¾Ëæ",
"¶Ô½²»ú",
"°ßÂí",
"»ÒÌ«ÀÇ",
"ÎÚÑ»",
"½ÖÎè",
"´óÐË°²Áë",
"Ë¤õÓ",
"ÒþË½",
"ÊÖÎè×ãµ¸",
"Æ¤Ð¦Èâ²»Ð¦",
"ÍÏÐ¬",
"ÒÔÑÀ»¹ÑÀ",
"ÔÎµ¹",
"¶«ÕÅÎ÷Íû",
"´óÊÖ´ó½Å",
"¹·¼±ÌøÇ½",
"´óÒ¡´ó°Ú",
"´ó¹«ÎÞË½",
"ÑÌ»Ò¸×",
"ÄÍ¿Ë",
"É¹ÒÂ·þ",
"¾Â²Ë",
"ÓêÉ",
"·çóÝ",
"»¨Ö¦ÕÐÕ¹",
"Ë¿¹Ï",
"¿ª³µ",
"¡¶Ë®ä°´«¡·",
"ÏÊ»¨²åÔÚÅ£·àÉÏ",
"Á÷ÐÇ",
"ÄÌÆ¿",
"Ò¹Ýº",
"·¢¼Ð",
"Ë®ÁúÍ·",
"Ëá·Û",
"´ó¿î",
"¿ÖÁú",
"Ñó´Ð",
"Ü½ÈØ½ã½ã",
"Ò»¼ýË«µñ",
"»¤Ä¿¾µ",
"ÌÀÔ²",
"´íÎó",
"ÅÄ»éÉ´ÕÕ",
"Î÷É½",
"Áì½±½ð",
"ÔÐ¸¾×°",
"°ü×Ó",
"ÃàÑò",
"ºÉ°üµ°",
"Æ»¹û",
"»ÆÉ½",
"æ©æ©À´³Ù",
"Íµ²Ë",
"ÐíÏÉ",
"Ä¦ÍÐ³µ",
"Êá×±Ì¨",
"ÃÅÁå",
"ÀóÖ¦",
"Ä§Êõ",
"»³ÔÐ",
"Í·ÐüÁº×¶´Ì¹É",
"Ò°Öí",
"ÈýÍ·Áù±Û",
"¶ú»·",
"ÑàÎÑ",
"µçÌÌ¶·",
"Ë§´ôÁË",
"ÊÖÃ¦½ÅÂÒ",
"Æ¡¾Æ",
"ÆÏÌÑ¾Æ",
"Ò»ÉúÒ»ÊÀ",
"ÖñËñ",
"¶«É½ÔÙÆð",
"Æó¶ì",
"ÔªÏü½Ú",
"Äò²»Êª",
"¾ÙÖØ",
"ÕÅ¹ÚÀî´÷",
"ÀÏ»¢",
"´òÂé½«",
"æÒÆ¤Ð¦Á³",
"Öí°Ë½ä±³Ï±¸¾",
"ÕùÏÈ¿Öºó",
"ÐÜÃ¨",
"Æß×ì°ËÉà",
"¶¥ÌìÁ¢µØ",
"Ì¹¿Ë",
"ÀºÇò",
"¿Õµ÷",
"¹®Àþ",
"ÇéÈË½Ú",
"Ò»µ¶Á½¶Ï",
"¡¶Èý¹úÑÝÒå¡·",
"°ü½È×Ó",
"ÑôË·",
"»»ÈÈÆ÷",
"°µÁµ",
"Èý¹úÑÝÒå"
				];
	};

	this.init();

}();
